[
  {
    "title": "IntelliWrite Pro",
    "image": "/project1.jpg",
    "description": "Custom AI writing assistant leveraging multiple LLMs for technical documentation, blog posts, and creative content with advanced context awareness.",
    "tech": ["React", "TypeScript", "OpenAI GPT-4", "LangChain", "FastAPI", "PostgreSQL"],
    "details": "Developed a specialized content creation platform that combines multiple language models for diverse writing tasks. Features include context-aware suggestions, industry-specific templates, plagiarism detection, and collaborative editing. Implemented custom prompt engineering and fine-tuning techniques for domain-specific content generation with 40% improvement in content quality metrics.",
    "demoUrl": "#portfolio-demo",
    "codeUrl": "#portfolio-code",
    "featured": true,
    "category": "AI/ML"
  },
  {
    "title": "DataViz Studio",
    "image": "/project2.jpg",
    "description": "Interactive business intelligence platform with machine learning-powered insights, automated anomaly detection, and customizable visualization components.",
    "tech": ["React", "D3.js", "Python", "Scikit-learn", "FastAPI", "Redis", "Docker"],
    "details": "Built a comprehensive analytics platform featuring interactive visualizations, predictive modeling, and automated insight generation. Includes real-time data streaming, custom dashboard builder, and ML-powered trend analysis. Achieved 25% faster data processing through optimized algorithms and implemented advanced statistical analysis for business intelligence.",
    "demoUrl": "#portfolio-demo",
    "codeUrl": "#portfolio-code",
    "featured": true,
    "category": "Full-Stack"
  },
  {
    "title": "DocuSmart AI",
    "image": "/project3.jpg",
    "description": "Intelligent document processing system using computer vision and NLP for automated data extraction, classification, and workflow integration.",
    "tech": ["Python", "OpenCV", "Transformers", "spaCy", "React", "MongoDB", "AWS S3"],
    "details": "Created an end-to-end document processing pipeline utilizing advanced OCR, named entity recognition, and document classification. Features include batch processing, quality validation, and API integration for existing workflows. Achieved 92% accuracy in data extraction and reduced manual processing time by 70% for enterprise clients.",
    "demoUrl": "#portfolio-demo",
    "codeUrl": "#portfolio-code",
    "featured": false,
    "category": "AI/ML"
  },
  {
    "title": "AgentFlow Framework",
    "image": "/project1.jpg", 
    "description": "Multi-agent coordination system for complex task automation featuring specialized AI agents for research, analysis, and content creation.",
    "tech": ["Python", "LangChain", "AutoGen", "React", "WebSocket", "Docker", "Kubernetes"],
    "details": "Designed a modular multi-agent system where specialized AI agents collaborate on complex workflows. Includes agent orchestration, task delegation, inter-agent communication, and human oversight capabilities. Successfully deployed for automated research synthesis, code review processes, and content creation pipelines with 60% efficiency improvement.",
    "demoUrl": "#portfolio-demo", 
    "codeUrl": "#portfolio-code",
    "featured": true,
    "category": "AI/ML"
  },
  {
    "title": "CollabSpace Hub",
    "image": "/project2.jpg",
    "description": "Modern team collaboration platform with real-time editing, integrated communication, project tracking, and AI-enhanced productivity features.",
    "tech": ["React", "Node.js", "Socket.io", "WebRTC", "MongoDB", "Redis", "Cloudflare"],
    "details": "Developed a comprehensive collaboration platform supporting real-time document editing, video conferencing, task management, and team analytics. Features AI-powered meeting summaries, intelligent notifications, and productivity insights. Built with scalable microservices architecture supporting 1000+ concurrent users with 99.9% uptime.",
    "demoUrl": "#portfolio-demo",
    "codeUrl": "#portfolio-code", 
    "featured": false,
    "category": "Full-Stack"
  },
  {
    "title": "TechBlog Engine",
    "image": "/project3.jpg",
    "description": "Personal technical blog platform with markdown support, syntax highlighting, search functionality, and integrated analytics dashboard.",
    "tech": ["Next.js", "TypeScript", "MDX", "Prisma", "PostgreSQL", "Vercel"],
    "details": "Built a custom blogging platform optimized for technical content with advanced markdown support, code highlighting, and search capabilities. Features include automated SEO optimization, reading analytics, newsletter integration, and responsive design. Achieved 95+ PageSpeed scores and implemented advanced caching strategies for optimal performance.",
    "demoUrl": "#portfolio-demo",
    "codeUrl": "#portfolio-code",
    "featured": false,
    "category": "Web Development"
  }
]
